/**
 * 백준 심화 1 25083 새싹
 * 
 * 
 * 
 * 제한사항
 *****************************************
 *          ,r'"7                        *
 * r`-_   ,'  ,/                         *
 *  \. ". L_r'                           *
 *    `~\/                               *
 *       |                               *
 *       |                               *
 *****************************************
 *
 *
 *
 * 주의
 * 
 * 
 * 풀이시간 5분
 */

#include <iostream>

using namespace std;

int main(void)
{
    cout << "         ,r'\"7\n";
    cout << "r`-_   ,'  ,/\n";
    cout << " \\. \". L_r'\n";
    cout << "   `~\\/\n";
    cout << "      |\n";
    cout << "      |\n";
    return 0;
}