///**
//* 백준 15552 빠른 A+B
//* 덧셈 연산을 할 때 입출력 방식을 제한하는 프로그램﻿ 최대 100만번의 입출력을 어떻게 제한시간 안에 처리할 것인가?에 대한 고려
//* 
//* 
//* 제한사항
//*****************************************
//* 0 < Test T <= 1,000,000				*
//* 1 <= A, B <= 1,000					*
//*****************************************
//*
//*
//*
//* 주의
//*
//*
//* 풀이시간 1분
//*/
//#define _CRT_SECURE_NO_WARNINGS
//
//#include <stdio.h>
//
//int main(void)
//{
//	int T;
//	scanf("%d", &T);
//	int A, B;
//	for (int i = 0; i < T; ++i)
//	{
//		scanf("%d%d", &A, &B);
//		printf("%d\n", A + B);
//	}
//	return 0;
//}