/**
 * 백준 알고리즘 수업 - 알고리즘의 수행 시간 2_24263
 * 입력받은 길이 만큼 배열을 순차 조회해서 더하여 합계를 구해 출력하는 프로그램
 * 반복의 수행 시간은 n만큼, 최고차 항은 1차 항이다.
 * 
 * MenOfPassion(A[], n) {
 *   sum <- 0;
 *   for i <- 1 to n
 *       sum <- sum + A[i]; # 코드1
 *   return sum;
 * }
 * 
 * 제한사항
 *****************************************
 * 0 < n <= 500,000                      *
 *****************************************
 *
 *
 *
 * 주의
 * 없다.
 * 
 * 풀이시간 0분
 */


#include <iostream>

using namespace std;

int main(void)
{
    int n;
    cin >> n;
    cout << n << '\n' << 1 << endl;
    return 0;
}